/*
Задача 3. Фільтрація масиву чисел
У task-3.js оголоси функцію filterArray(numbers, value). Вона має повернути новий масив лише з тими числами, які більші за value.
Створи всередині функції порожній масив для результату.
Перебери всі елементи numbers циклом for або for...of.
Для кожного числа перевір умову: воно має бути строго більшим за value.
Якщо умова виконується, додай число до нового масиву методом push().
Після завершення циклу поверни новий масив.
Додай п’ять викликів console.log з ТЗ і залиш їх для ментора.
Числа, які дорівнюють value, не потрапляють до результату.
Перевір роботу у консолі
Відкрий index.html у браузері, запусти DevTools і перейди на вкладку Console.
Звір всі результати з коментарями біля викликів console.log.
Переконайся, що slugify працює з різним регістром літер.
Перевір makeArray, коли maxLength менше, дорівнює та перевищує довжину об’єднаного масиву.
Перевір, що filterArray повертає порожній масив, якщо жодне число не більше за value.
Виклич кожну функцію з іншими валідними аргументами.
Переконайся, що в консолі немає помилок і попереджень.
Не здавай роботу, поки в консолі є помилки або попередження.
*/
'use strict';

function filterArray(numbers, value) {
    const evenNumbers = [];
    for( const number of numbers) {
        if( number > value) {
            evenNumbers.push(number)
        }
    }
    return evenNumbers
}

console.log(filterArray([1, 2, 3, 4, 5], 3)); // [4, 5]
console.log(filterArray([1, 2, 3, 4, 5], 4)); // [5]
console.log(filterArray([1, 2, 3, 4, 5], 5)); // []
console.log(filterArray([12, 24, 8, 41, 76], 38)); // [41, 76]
console.log(filterArray([12, 24, 8, 41, 76], 20)); // [24, 41, 76]